{
    "class_name": "Functional",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        64,
                        64,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_3"
                },
                "name": "input_3",
                "inbound_nodes": []
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "layer0",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    64,
                                    64,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "conv2d_69_input"
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_69",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "HeNormal",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d_2",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    3,
                                    3
                                ],
                                "padding": "same",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_5",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "ReLU",
                            "config": {
                                "name": "re_lu_2",
                                "trainable": true,
                                "dtype": "float32",
                                "max_value": null,
                                "negative_slope": 0.0,
                                "threshold": 0.0
                            }
                        }
                    ]
                },
                "name": "layer0",
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "layer1",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    32,
                                    32,
                                    64
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "res_net_block_8_input"
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 64,
                                "downsample": false,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_70",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 64,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "conv2": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_71",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 64,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "shortcut": {
                                    "class_name": "Sequential",
                                    "config": {
                                        "name": "sequential_8",
                                        "layers": [],
                                        "build_input_shape": [
                                            null,
                                            32,
                                            32,
                                            64
                                        ]
                                    }
                                }
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 64,
                                "downsample": false,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_72",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 64,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "conv2": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_73",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 64,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "shortcut": {
                                    "class_name": "Sequential",
                                    "config": {
                                        "name": "sequential_9",
                                        "layers": [],
                                        "build_input_shape": [
                                            null,
                                            32,
                                            32,
                                            64
                                        ]
                                    }
                                }
                            }
                        }
                    ]
                },
                "name": "layer1",
                "inbound_nodes": [
                    [
                        [
                            "layer0",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "layer2",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    32,
                                    32,
                                    64
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "res_net_block_10_input"
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 128,
                                "downsample": true,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_74",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 128,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            2,
                                            2
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "conv2": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_76",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 128,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "shortcut": {
                                    "class_name": "Sequential",
                                    "config": {
                                        "name": "sequential_10",
                                        "layers": [
                                            {
                                                "class_name": "InputLayer",
                                                "config": {
                                                    "batch_input_shape": [
                                                        null,
                                                        32,
                                                        32,
                                                        64
                                                    ],
                                                    "dtype": "float32",
                                                    "sparse": false,
                                                    "ragged": false,
                                                    "name": "conv2d_75_input"
                                                }
                                            },
                                            {
                                                "class_name": "Conv2D",
                                                "config": {
                                                    "name": "conv2d_75",
                                                    "trainable": true,
                                                    "dtype": "float32",
                                                    "filters": 128,
                                                    "kernel_size": [
                                                        1,
                                                        1
                                                    ],
                                                    "strides": [
                                                        2,
                                                        2
                                                    ],
                                                    "padding": "same",
                                                    "data_format": "channels_last",
                                                    "dilation_rate": [
                                                        1,
                                                        1
                                                    ],
                                                    "groups": 1,
                                                    "activation": "linear",
                                                    "use_bias": true,
                                                    "kernel_initializer": {
                                                        "class_name": "HeNormal",
                                                        "config": {
                                                            "seed": null
                                                        }
                                                    },
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "kernel_regularizer": null,
                                                    "bias_regularizer": null,
                                                    "activity_regularizer": null,
                                                    "kernel_constraint": null,
                                                    "bias_constraint": null
                                                }
                                            },
                                            {
                                                "class_name": "BatchNormalization",
                                                "config": {
                                                    "name": "batch_normalization_6",
                                                    "trainable": true,
                                                    "dtype": "float32",
                                                    "axis": [
                                                        3
                                                    ],
                                                    "momentum": 0.99,
                                                    "epsilon": 0.001,
                                                    "center": true,
                                                    "scale": true,
                                                    "beta_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "gamma_initializer": {
                                                        "class_name": "Ones",
                                                        "config": {}
                                                    },
                                                    "moving_mean_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "moving_variance_initializer": {
                                                        "class_name": "Ones",
                                                        "config": {}
                                                    },
                                                    "beta_regularizer": null,
                                                    "gamma_regularizer": null,
                                                    "beta_constraint": null,
                                                    "gamma_constraint": null
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 128,
                                "downsample": false,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_77",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 128,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "conv2": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_78",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 128,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "shortcut": {
                                    "class_name": "Sequential",
                                    "config": {
                                        "name": "sequential_11",
                                        "layers": [],
                                        "build_input_shape": [
                                            null,
                                            16,
                                            16,
                                            128
                                        ]
                                    }
                                }
                            }
                        }
                    ]
                },
                "name": "layer2",
                "inbound_nodes": [
                    [
                        [
                            "layer1",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "layer3",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    16,
                                    16,
                                    128
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "res_net_block_12_input"
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 256,
                                "downsample": true,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_79",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 256,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            2,
                                            2
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "conv2": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_81",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 256,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
                                        "use_bias": true,
                                        "kernel_initializer": {
                                            "class_name": "HeNormal",
                                            "config": {
                                                "seed": null
                                            }
                                        },
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "kernel_regularizer": null,
                                        "bias_regularizer": null,
                                        "activity_regularizer": null,
                                        "kernel_constraint": null,
                                        "bias_constraint": null
                                    }
                                },
                                "shortcut": {
                                    "class_name": "Sequential",
                                    "config": {
                                        "name": "sequential_12",
                                        "layers": [
                                            {
                                                "class_name": "InputLayer",
                                                "config": {
                                                    "batch_input_shape": [
                                                        null,
                                                        16,
                                                        16,
                                                        128
                                                    ],
                                                    "dtype": "float32",
                                                    "sparse": false,
                                                    "ragged": false,
                                                    "name": "conv2d_80_input"
                                                }
                                            },
                                            {
                                                "class_name": "Conv2D",
                                                "config": {
                                                    "name": "conv2d_80",
                                                    "trainable": true,
                                                    "dtype": "float32",
                                                    "filters": 256,
                                                    "kernel_size": [
                                                        1,
                                                        1
                                                    ],
                                                    "strides": [
                                                        2,
                                                        2
                                                    ],
                                                    "padding": "same",
                                                    "data_format": "channels_last",
                                                    "dilation_rate": [
                                                        1,
                                                        1
                                                    ],
                                                    "groups": 1,
                                                    "activation": "linear",
                                                    "use_bias": true,
                                                    "kernel_initializer": {
                                                        "class_name": "HeNormal",
                                                        "config": {
                                                            "seed": null
                                                        }
                                                    },
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "kernel_regularizer": null,
                                                    "bias_regularizer": null,
                                                    "activity_regularizer": null,
                                                    "kernel_constraint": null,
                                                    "bias_constraint": null
                                                }
                                            },
                                            {
                                                "class_name": "BatchNormalization",
                                                "config": {
                                                    "name": "batch_normalization_7",
                                                    "trainable": true,
                                                    "dtype": "float32",
                                                    "axis": [
                                                        3
                                                    ],
                                                    "momentum": 0.99,
                                                    "epsilon": 0.001,
                                                    "center": true,
                                                    "scale": true,
                                                    "beta_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "gamma_initializer": {
                                                        "class_name": "Ones",
                                                        "config": {}
                                                    },
                                                    "moving_mean_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {}
                                                    },
                                                    "moving_variance_initializer": {
                                                        "class_name": "Ones",
                                                        "config": {}
                                                    },
                                                    "beta_regularizer": null,
                                                    "gamma_regularizer": null,
                                                    "beta_constraint": null,
                                                    "gamma_constraint": null
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        },
                        {
                            "class_name": "ResNetBlock",
                            "config": {
                                "channels": 256,
                                "downsample": false,
                                "conv1": {
                                    "class_name": "Conv2D",
                                    "config": {
                                        "name": "conv2d_82",
                                        "trainable": true,
                                        "dtype": "float32",
                                        "filters": 256,
                                        "kernel_size": [
                                            3,
                                            3
                                        ],
                                        "strides": [
                                            1,
                                            1
                                        ],
                                        "padding": "same",
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1,
                                            1
                                        ],
                                        "groups": 1,
                                        "activation": "linear",
